Revit 2027 API
SpotLightDistribution.SpotFieldAngle Property
 The spot field angle.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SpotFieldAngle { get; set; }
Public Property SpotFieldAngle As Double
	Get
	Set
public:
property double SpotFieldAngle {
	double get ();
	void set (double value);
}
member SpotFieldAngle : float with get, set
Property Value
Double
 The spot beam angle as a numerical value in radians between 0 and (8/9)*PI.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The angle is not valid because it is not between 1.0e-2 and 160.0.
See Also
Reference
SpotLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace